---

C#Visual BasicVisual C++

Revit 2024 API
---
MEPConnectorInfo..::..LinkedConnector Property
MEPConnectorInfo Class See Also Send Feedback
---

The linked connector or nullNothingnullptra null reference (Nothing in Visual Basic) if there is no linked connector

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016

# Syntax

C#
---

    public Connector LinkedConnector { get; }

Visual Basic
---

    Public ReadOnly Property LinkedConnector As Connector
    	Get

Visual C++
---

    public:
    property Connector^ LinkedConnector {
    	Connector^ get ();
    }

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also

MEPConnectorInfo Class

Autodesk.Revit.DB Namespace